In [7]:
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt
engine = create_engine('postgresql://postgres:PostGresPasscode@localhost/EmployeeSQL')
connection = engine.connect()

In [8]:
salaries=pd.read_sql("SELECT * FROM salaries", connection)
salaries.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228